driver-tests/aspectse/Throttling/ThrottlingRqstRespCompositeApp/test/TestCase1/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hel="http://xml.netbeans.org/schema/hello">
  <soapenv:Body>
    <hel:input>Testing Throttling Aspect with Rqst Resp HelloWS</hel:input>
  </soapenv:Body>
</soapenv:Envelope>